Revit 2027 API
ParameterTypeId.RbsCurvetypeMultishapeTransitionParam Property
 "Multi Shape Transition Rect to Round"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCurvetypeMultishapeTransitionParam { get; }
Public Shared ReadOnly Property RbsCurvetypeMultishapeTransitionParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCurvetypeMultishapeTransitionParam {
	ForgeTypeId^ get ();
}
static member RbsCurvetypeMultishapeTransitionParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace